Конфигурация/InformationRegisters/НастройкиФормированияСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиФормированияСЧА</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаСЧА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРегламентныхДействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРасчетныйКупон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДВСправедливойСтоимостиЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаПроцентовПоСделкамРЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПроцентовПоСделкамРЕПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРасчетнойСтавкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КритерийСущественностиОтклоненияССТПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНастройкиУчетнойПолитикиЕПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьНачисленияРезервов</Name>
					<Comment>#538027</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорзинаОФЗПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорзиныОФЗПК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиФормированияСЧА/Ext/ManagerModule.bsl
Функция ПолучитьГруппировкиОбщихНастроек() Экспорт
	
	РесурсыСГруппировкой = Новый ТаблицаЗначений;
	
	РесурсыСГруппировкой.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	РесурсыСГруппировкой.Колонки.Добавить("Синоним", Новый ОписаниеТипов("Строка"));
	РесурсыСГруппировкой.Колонки.Добавить("Группа", Новый ОписаниеТипов("Строка"));

	МакетГруппировки = РегистрыСведений.НастройкиФормированияСЧА.ПолучитьМакет("ГруппировкаНастроек");
	
	НомСтр = 2;
	
	Пока СокрЛП(МакетГруппировки.Область(НомСтр, 1).Текст) <> "" Цикл
		
		НоваяСтрокаРесурсыСГруппировкой = РесурсыСГруппировкой.Добавить(); 
		
		НоваяСтрокаРесурсыСГруппировкой.Имя = СокрЛП(МакетГруппировки.Область(НомСтр, 1).Текст);
		НоваяСтрокаРесурсыСГруппировкой.Группа = СокрЛП(МакетГруппировки.Область(НомСтр, 2).Текст);
		
		Если СокрЛП(НоваяСтрокаРесурсыСГруппировкой.Группа) = "" Тогда
		
			НоваяСтрокаРесурсыСГруппировкой.Группа = "Прочие";
		
		КонецЕсли;
		
		НомСтр = НомСтр + 1;
	
	КонецЦикла;
	
	Для каждого РесурсРегистра Из Метаданные.РегистрыСведений.НастройкиФормированияСЧА.Ресурсы Цикл
		
		СтрокаРесурсыСГруппировкой = РесурсыСГруппировкой.Найти(РесурсРегистра.Имя, "Имя");
		
		Если СтрокаРесурсыСГруппировкой = Неопределено Тогда
		
			НоваяСтрокаРесурсыСГруппировкой = РесурсыСГруппировкой.Добавить(); 
			
			НоваяСтрокаРесурсыСГруппировкой.Имя = РесурсРегистра.Имя;
			НоваяСтрокаРесурсыСГруппировкой.Синоним = РесурсРегистра.Синоним;
			НоваяСтрокаРесурсыСГруппировкой.Группа = "Прочие";
			
		Иначе
			
			СтрокаРесурсыСГруппировкой.Синоним = РесурсРегистра.Синоним;
			
		КонецЕсли;
	
	КонецЦикла;
	
	РесурсыСГруппировкой.Сортировать("Группа,Имя");
	
	Возврат РесурсыСГруппировкой;

КонецФункции 

Функция ПолучитьБлижайшуюДатуФормированияСЧА(Организация, СчетДоверительногоУправления, Период) Экспорт

	ПоследнийРабочийДень = Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, Период);
	
	Если Период = ПоследнийРабочийДень Тогда
	
		ДатаФормированияСЧА = Период;
		
	Иначе
		
		ОтсутствуютНастройки = Ложь;
		ДатаФормированияСЧА = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(СчетДоверительногоУправления, КонецДня(Период)+1, ОтсутствуютНастройки);
		
		Если ОтсутствуютНастройки Тогда	
			ТекстОшибки = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку("Для клиента %1 не заданы настройки формирования СЧА на %2", СчетДоверительногоУправления, Формат(Период, "ДФ=dd.MM.yyyy"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат Неопределено;
		ИначеЕсли ДатаФормированияСЧА = Неопределено Тогда	
			ТекстОшибки = РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку("Для клиента %1 не удалось получить дату предыдущего расчета СЧА. Возможно, не заданы настройки формирования СЧА на %2", СчетДоверительногоУправления, Формат(Период, "ДФ=dd.MM.yyyy"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат Неопределено;
		КонецЕсли; 
		
		Если ПоследнийРабочийДень > ДатаФормированияСЧА Тогда
			ДатаФормированияСЧА = ПоследнийРабочийДень;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат НачалоДня(ДатаФормированияСЧА);
	
КонецФункции
 
Функция ОпределитьНастройки(Период, Организация, СчетДоверительногоУправления, Отказ = Ложь) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НастройкиФормированияСЧАСрезПоследних.*
		|ИЗ
		|	РегистрСведений.НастройкиФормированияСЧА.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиФормированияСЧАСрезПоследних");
		
	Запрос.УстановитьПараметр("Период",                       Период);
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		
		Ресурсы = Новый Массив;
		Для Каждого Ресурс Из Метаданные.РегистрыСведений.НастройкиФормированияСЧА.Ресурсы Цикл
			Ресурсы.Добавить(Ресурс.Имя);
		КонецЦикла;
		СписокРесурсов = СтрСоединить(Ресурсы, ","); 
		
		Настройки = Новый Структура(СписокРесурсов);
		ЗаполнитьЗначенияСвойств(Настройки, Выборка, СписокРесурсов);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("На %1 для клиента %2 не заданы настройки формирования СЧА", Формат(Период, "ДФ=dd.MM.yyyy"), СчетДоверительногоУправления), , , , Отказ);
			
		Настройки = Неопределено;	
		
	КонецЕсли;

	Возврат Настройки;
	
КонецФункции

Функция ДатаНачалаИспользованияНастроекУчетнойПолитикиЕПСПриРасчетеСЧА() Экспорт
	
	Возврат '20240412';
	
КонецФункции

Функция ЕжедневноеФормированиеСЧА(Период, Организация, СчетДоверительногоУправления) Экспорт
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НастройкиФормированияСЧАСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.НастройкиФормированияСЧА.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиФормированияСЧАСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиРегламентныхДействий.Настройки КАК НастройкиРегламентныхДействийНастройки
		|		ПО НастройкиФормированияСЧАСрезПоследних.ПериодичностьРасчетаСЧА = НастройкиРегламентныхДействийНастройки.Ссылка
		|			И (НастройкиРегламентныхДействийНастройки.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПереоценкиАктивов.Ежедневно))");
		
	Запрос.УстановитьПараметр("Период",                       Период);
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);

	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
КонецФункции
